DataProcessors/ПеремещениеТовараИзЯчейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПеремещениеТовараИзЯчейки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеИзЯчейкиМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПеремещениеТовараИзЯчейки/Forms/ФормаВыбораЯчейкиОткуда/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыПриПеремещении();
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);
 		
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЯчейку(Команда)
	
	ЗапроситьЯчейкуСсервера(Объект.ЯчейкаОткуда);	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗапроситьЯчейкуСсервера(Текст)
	
	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
	
	Результат = ОбщегоНазначения.ПолучитьЯчейку(Текст);                     
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		
		ТекстОшибки = "Ячейка " + Текст + " некорректна !!!" + Символы.ПС;
		ТекстОшибки = ТекстОшибки + Результат.Ошибка;
		ПоказатьПредупреждение(,"Ошибка: " + ТекстОшибки, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ТекстОшибки, "Ячейка");							
		Объект.ЯчейкаОткудаГУИД = "";		
		Объект.ЯчейкаОткуда = "";
		Возврат;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Результат.Данные) Тогда	
		
		РезультатСтруктура = ОбщегоНазначения.ЕстьЛиТоварыВЯчейке(Результат.Данные);
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
			Возврат;
		КонецЕсли;
		
		Если Не РезультатСтруктура.Данные Тогда			
			ПоказатьПредупреждение(,"В ячейке " + Текст + " нет товаров для перемещения.", 4);	
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Результат.Данные) Тогда                         
		
		Объект.ЯчейкаОткудаГУИД = Результат.Данные;
		Объект.ЯчейкаОткуда = Текст;				
				
		ПараметрыРаботы = ОбщегоНазначенияКлиент.СформироватьПараметрыДляФормы("ПеремещениеТовараИзЯчейки", Объект);
		ОбщегоНазначения.ЗаписатьПараметрыРаботы( "ПараметрыРаботыПриПеремещении", ПараметрыРаботы );			
					
		Закрыть();
		ОткрытьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаВыбораЯчейкиКуда");
					
	КонецЕсли; 
		
КонецПроцедуры
 
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	

	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
		КонецЕсли; 
		
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ЗапроситьЯчейкуСсервера(Результат.Штрихкод);		
		КонецЕсли; 
		
		
	ИначеЕсли Событие = "ClipboardEvent" Тогда                 
		ЗапроситьЯчейкуСсервера(Данные);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура Завершить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("СоздатьДокументПеремещения", ЭтотОбъект, Параметры);
	ТекстВопроса = "Создать документ(ы) перемещения  " + Символы.ПС;
	ТекстВопроса = ТекстВопроса + " между ячейками ?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим); 
		
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокументПеремещения(Результат, Параметры) Экспорт
		
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;	
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокЯчеекДляПеремещения();
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;                                                                                    
	КонецЕсли; 
	
	ТекстСообщения = "Создан документ перемещения по ячейкам № %1 %2. Документ проведен";
	ТекстСообщенияРезультат = "";
	Для Индекс = 0 По РезультатСтруктура.Данные.Количество() - 1 Цикл
		
		ЯчейкаОткудаGUID = РезультатСтруктура.Данные[Индекс].СсылкаЯчейки;
		ЯчейкаКудаGUID = РезультатСтруктура.Данные[Индекс].СсылкаЯчейкиКуда;
		
		Результат = ОбщегоНазначения.СоздатьДокументПеремещенияМеждуЯчейкам(ЯчейкаОткудаGUID, ЯчейкаКудаGUID);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда                                                      
			ПоказатьПредупреждение(,"Ошибка: " + Результат.Ошибка, 4);			
			Продолжить;
		КонецЕсли; 
				
		ТекстСообщенияРезультат = ТекстСообщенияРезультат 
								  + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
									Строка(Результат.Данные.НомерДокумента),
									Строка(Результат.Данные.ДатаДокумента) 
									) + Символы.ПС;						
		
	КонецЦикла;  
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытьФормуПослеСообщения", ЭтотОбъект, Параметры);
	ПоказатьПредупреждение(Оповещение, ТекстСообщенияРезультат, 5);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуПослеСообщения(Результат) Экспорт 
	Закрыть();
КонецПроцедуры
